In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('cinema')

+----+------------+-------------+--------+
| id |   movie    | description | rating |
+----+------------+-------------+--------+
| 1  |    War     |   great 3D  |  8.9   |
| 2  |  Science   |   fiction   |  8.5   |
| 3  |   irish    |    boring   |  6.2   |
| 4  |  Ice song  |   Fantacy   |  8.6   |
| 5  | House card | Interesting |  9.1   |
+----+------------+-------------+--------+

### Write an SQL query to report the movies with an odd-numbered ID and a description that is not "boring".
- #### *Return the result table ordered by rating in descending order.*
```
+----+------------+-------------+--------+
| id | movie      | description | rating |
+----+------------+-------------+--------+
| 5  | House card | Interesting | 9.1    |
| 1  | War        | great 3D    | 8.9    |
+----+------------+-------------+--------+
Explanation: 
We have three movies with odd-numbered IDs: 1, 3, and 5. The movie with ID = 3 is boring so we do not include it in the answer.
```

In [35]:
%%sql 

SELECT 
    id, movie, description, rating 
FROM cinema 
WHERE id % 2 !=0 AND description NOT LIKE 'boring'
ORDER BY rating DESC;

[(5, 'House card', 'Interesting', 9.1), (1, 'War', 'great 3D', 8.9)]

# BETTER VERSION

### Write an SQL query to report the movies with an odd-numbered rating.

In [63]:
%%sql 

SELECT 
    rating % 2,
    MOD(rating, 2)
FROM cinema;

[(0.9, 0.9), (0.5, 0.5), (0.2, 0.2), (0.6, 0.6), (1.1, 1.1)]

In [58]:
%%sql 

-- as seen above, the floats need to be converted to integer values 
-- one way to do is to multiply the value by 10 

SELECT 
    (rating * 10) % 2 AS actual_value,
    MOD(rating * 10, 2) = 1 AS true_false_result
FROM cinema;

[(1.0, 1), (1.0, 1), (2.0, 0), (0.0, 0), (1.0, 1)]

In [50]:
%%sql 
-- movies with odd-numbered ratings
SELECT
    id, movie, description, rating
FROM cinema 
WHERE MOD(rating*10,2) = 1;

[(1, 'War', 'great 3D', 8.9),
 (2, 'Science', 'fiction', 8.5),
 (5, 'House card', 'Interesting', 9.1)]

In [60]:
%%sql 

-- movies with even-numbered ratings
SELECT
    id, movie, description, rating
FROM cinema 
WHERE MOD(rating*10,2) != 1;

[(3, 'irish', 'boring', 6.2), (4, 'Ice song', 'Fantacy', 8.6)]

# Using Pandas

In [64]:
import pandas as pd

In [65]:
cinema_query = %sql SELECT * FROM cinema # type: ignore
cinema_df = cinema_query.DataFrame()
cinema_df

   id       movie  description  rating
0   1         War     great 3D     8.9
1   2     Science      fiction     8.5
2   3       irish       boring     6.2
3   4    Ice song      Fantacy     8.6
4   5  House card  Interesting     9.1

## loc []

In [103]:
cinema_df.loc[(cinema_df['description'] != 'boring') & (cinema_df['id'] % 2 != 0)] \
    .sort_values(by='id', ascending=False)

   id       movie  description  rating
4   5  House card  Interesting     9.1
0   1         War     great 3D     8.9

## query()

In [104]:
cinema_df.query("id % 2 != 0 and description != 'boring'") \
    .sort_values('id', ascending=False) # by keyword is optional

   id       movie  description  rating
4   5  House card  Interesting     9.1
0   1         War     great 3D     8.9

## filter()

In [105]:
cinema_df.filter(items=['id', 'movie', 'description', 'rating']) \
    .loc[(cinema_df['description'] != 'boring') &
         (cinema_df['id'] %2 != 0)] \
    .sort_values(by=['id'], ascending=False) # can sort by multiple columns

   id       movie  description  rating
4   5  House card  Interesting     9.1
0   1         War     great 3D     8.9